<?php

namespace Faker\Provider\ge_GE;

class Address extends \Faker\Provider\Address
{
    protected static $streetPrefix = array(
        'ქუჩა',
    );

    protected static $streetNameFormats = array(
        '{{street}}',
        '{{streetPrefix}} {{street}}',
    );

    protected static $streetAddressFormats = array(
        '{{streetName}} {{buildingNumber}}',
    );

    protected static $cityFormats = array(
        '{{cityName}}',
    );

    /**
     * @link https://www.openstreetmap.org
     */
    protected static $street = array(
         'თამარ მეფის', 'გალაკტიონ ტაბიძის ქეჩა', 'ჯავახიშვილის', 'ჭავჭავაძის გამზირი', 'აღმაშენებლის გამზირი', 'ვარლამიშვილის', 'აკაკი ხორავას', 'წერეთლის', 'ნიკეას', 'ალექსანდრე პუშკინის', 'ბორის გაპონოვის', 'ლადო ასათიანის ქეჩა', 'ზაქარია ფალიაშვილის', 'წმინდა ნინოს', 'ლილი ნუცუბიძის', 'შოთა რუსთაველის გამზირი', 'ჩეჩელაშვილის', 'გორის', 'ლესელიძის', 'კ. გამსახურდიას', 'სოლომონ  პირველის', 'ახალგაზრდობის გამზირი', 'ორბელიანის', 'სოლომონ მეორეს უჩა', 'მერაბ კოსტავას', 'თავისუფლების', 'რაკვერეს', 'რუსთაველის გამზირი', 'ფალიაშვილის შესახვევი', 'ერისთავის', 'რუსთაველის', 'მაქსიმ გორკის', 'ცაცხვების', '26 მაისის', 'ფარნავაზ მეფის', 'ლერმონტოვის II შესახვევი', '9 აპრილის', 'ბუხაიძის', 'გამსახურდიას', 'აბაშიძის', 'ზვიად გამსახურდიას', 'ნიუპორტის', 'მამუკა ასლანიკაშვილის', 'აკაკი კიბორძალიძის', 'იაკობ გოგებაშვილის', 'დები იშხნელების', 'პუშკინის II ჩიხი', 'მეგრელიძის', 'ჟიულ შარტავას III შესახვევი', 'ვახუშტი ბაგრატიონის', 'სოხუმის', 'ლევ ტოლსტოის ქუჩ', 'გოგიას ციხის', 'მშვიდობის', 'იონა მეუნარგიას', 'სპირიდონ კედიას', 'თაბუკაშვილის', 'მახვილაძის', 'ახალგაზრდობის გამზ. მე-2 შეს', 'ბუკიას', 'გიორგი ბრწყინვალეს', 'ცისფერყანწელთა', 'დუტუ მეგრელის ჩიხი', 'მესხეთის', 'გველესიანის', 'დავითაშვილის', 'მჭედლიძის', 'სოხუმის I ჩიხი', 'ნოდარ დუმბაძის', 'სულხან საბას', 'ნიკო ლორთქიფანიძის', 'კაკაბაძის', 'ნიკეას მე-9 ჩიხი', 'ეგნატე ნინოშვილის', 'იოსებ გრიშაშვილის', 'დავითაშვილის II შესახვევი', 'ასათიანის II შეს.', 'დავითაშვილის III ჩიხი', 'ზვიად გამსახურდიას გამზირი', 'ზურაბ ანჯაფარიძის', 'ჯავახიშვილის I შესახვევი', 'ტიციან ტაბიძის', 'კუპრაძის', 'დავით და კონსტანტინე მხეიძეების', 'სოლომონ მეორის I ჩიხი', 'ჩანჩიბაძის', 'ზ. ჭავჭავაძის', 'ოცხელის', 'ავტომშენებლის', 'ჩეჩელაშვილის I შესახვევი', 'ბუხაიძის II შესახვვი', 'მუსხელიშვილის V შეს.', 'სოლომონ პირველის', 'გუგუნავას', 'ხარებავას', 'ჟიულ შარტავას', 'მაისურაძის', 'ხუნდაძის', 'დადიანის', 'მაისურაძის II შეს.', 'გაბრიელ ეპისკოპოსის', 'კ. გამსახურდიას IV ჩიხი', 'პეტრე მელიქიშვილის', 'გელათის', 'ნიკეას II შეს', 'ჭავჭავაძის გამზ.', 'ჩოლოყაშვილის', 'ნინოშვილის', 'ბორჯომის', 'წითელხევი', 'წმინდა ნინოს', 'ჯეოჰოსპიტალი', 'შათირიშვილი', 'რუხი მოლი ბ', 'ექვთიმე თაყაიშვილის'
    );

    /**
     * @link https://en.wikipedia.org/wiki/List_of_cities_and_towns_in_Georgia_(country)
     */
    protected static $cityNames = array(
        'თბილისი','ქუთაისი','ბათუმი','რუსთავი','ზუგდიდი','გორი','ფოთი','სამტრედია','ხაშური','სენაკი','ზესტაფონი','მარნეული','თელავი','ახალციხე','ქობულეთი','ოზურგეთი','წყალტუბო','კასპი','გარდაბანი','ჭიათურა','ტყიბული','ბორჯომი','საგარეჯო','ბოლნისი','ხონი','გურჯაანი','ახალქალაქი','წალენჯიხა','ყვარელი','ახმეტა','მცხეთა','ქარელი','ლანჩხუთი','ლაგოდეხი','დედოფლისწყარო','დუშეთი','საჩხერე','აბაშა','წნორი','ნინოწმინდა','თერჯოლა','ხობი','მარტვილი','ვალე','ჯვარი','ბაღდათი','ვანი','თეთრი წყარო','დმანისი','ონი','ანაკლია','ამბროლაური','სიღნაღი','წალკა','ცაგერი'
    );

    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    public static function street()
    {
        return static::randomElement(static::$street);
    }

    public function cityName()
    {
        return static::randomElement(static::$cityNames);
    }
}
